{
  "personalInfo": {
    "name": "ADHAM AL MECHKOR",
    "title": "Full Stack Developer",
    "contactDetails": {
      "phone": "+212 714268801",
      "email": "aalmechkor2@gmail.com",
      "location": "Tangier, Morocco"
    },
    "about": "I am Adham Almechkor, a passionate Full Stack Developer currently pursuing a degree in Digital Development. At 23 years old, I am driven by a desire to innovate and create solutions that enhance the digital landscape. My journey in digital development has equipped me with a solid foundation in programming languages such as HTML, CSS, JavaScript, Python, and React."
  },
  "githubStats": {
    "skills": ["HTML", "CSS", "JavaScript", "TypeScript"]
  },
  "projects": [
    {
      "name": "E-commerce Website",
      "technologies": ["Laravel", "React", "Redux", "Tailwind"],
      "description": "I worked with three-person teams to create an e-commerce website from scratch for a class project.",
      "path": "https://github.com/adhamito/ad"
    },
    {
      "name": "Library Management System",
      "technologies": ["Laravel", "React"],
      "description": "Our project aimed to develop a comprehensive library management system that streamlined cataloging, lending, and tracking of resources to enhance accessibility and efficiency for both librarians and patrons.",
      "path": "https://github.com/adhamito/bilb_laravel-"
    },
    {
      "name": "Portfolio Website",
      "technologies": ["HTML", "CSS", "React", "Tailwind"],
      "description": "Developing a comprehensive website portfolio to showcase my projects, services, and capabilities.",
      "path": "https://github.com/adhamito/my-portfolio"
    },
    {
      "name": "Estima-Dashboard",
      "technologies": ["Next.js", "Tailwind", "ShadcnUI", "Typescript"],
      "description": "Estima-Dashboard is a responsive web application built with Next.js and styled using Tailwind CSS. It provides real-time insights and data visualization, allowing users to easily monitor essential metrics. With its sleek design and intuitive interface, Estima-Dashboard enhances productivity for personal and professional use.",
      "path": "https://github.com/adhamito/Estima-Dashboard-"
    },
    {
      "name": "Cv-Template",
      "technologies": ["Next.js", "Tailwind", "JavaScript"],
      "description": "Cv-Template is a sleek and modern resume builder designed to help job seekers create professional CVs effortlessly. Utilizing Next.js for dynamic rendering and Tailwind CSS for customizable, responsive designs, this project allows users to craft visually appealing resumes that stand out. It's perfect for anyone looking to build a standout CV quickly and efficiently.",
      "path": "https://github.com/adhamito/cv-template"
    }
  ],
  "skills": [
    "HTML",
    "CSS",
    "JavaScript",
    "React",
    "Node.js",
    "Python",
    "Laravel",
    "Git",
    "Tailwind CSS",
    "Redux",
    "next.js"
  ],
  "furtherEducation": {
    "courses": ["Complete mastery of Full Stack Web - Udemy"],
    "currentlyLearning": ["Next js", "Nest js", "Cloud Native"]
  },
  "educations": [
    {
      "degree": "Baccalaureate",
      "major": "Physical Sciences",
      "institution": "School Tingis",
      "duration": "2019-2020"
    },
    {
      "degree": "English Studies",
      "institution": "Uskudar University",
      "duration": "2020-2021"
    },
    {
      "degree": "Economics",
      "institution": "AbdelMalik Essaadi University",
      "duration": "2021-2022"
    },
    {
      "degree": "Full Stack Development",
      "institution": "Ismontic",
      "duration": "2022-2024"
    }
  ],
  "experiences": [
    {
      "title": "Software Development Intern",
      "company": "The Bridger",
      "location": "Tangier, Morocco",
      "durationStart": "01/01/2024",
      "durationEnd": "04/06/2024",
      "description": "As part of my Final Year Project (PFE) as a Full Stack Developer, I worked on a range of projects, including e-commerce platforms, library management systems, and portfolio websites. My responsibilities involved collaborating closely with stakeholders to define project requirements, designing and developing end-to-end web solutions, and ensuring optimal system performance. This project allowed me to apply theoretical knowledge in a practical setting and enhanced my skills in full-stack development."
    }
  ]
}
